cmsis-svd/cmsis-svd/data/SiliconLabs/EFM32TG11B520F128GQ80.svd
        <register>
          <name>CC2_CTRL</name>
          <description>CC Channel Control Register</description>
          <addressOffset>0x080</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x7F073F17</resetMask>
          <fields>
            <field>
              <name>MODE</name>
              <description>CC Channel Mode</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OFF</name>
                  <description>Compare/Capture channel turned off</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INPUTCAPTURE</name>
                  <description>Input capture</description>
                  <value>0x00000001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OUTPUTCOMPARE</name>
                  <description>Output compare</description>
                  <value>0x00000002</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWM</name>
                  <description>Pulse-Width Modulation</description>
                  <value>0x00000003</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OUTINV</name>
              <description>Output Invert</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>COIST</name>
              <description>Compare Output Initial State</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CMOA</name>
              <description>Compare Match Output Action</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>No action on compare match</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TOGGLE</name>
                  <description>Toggle output on compare match</description>
                  <value>0x00000001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLEAR</name>
                  <description>Clear output on compare match</description>
                  <value>0x00000002</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SET</name>
                  <description>Set output on compare match</description>
                  <value>0x00000003</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>COFOA</name>
              <description>Counter Overflow Output Action</description>
              <bitOffset>10</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>No action on counter overflow</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TOGGLE</name>
                  <description>Toggle output on counter overflow</description>
                  <value>0x00000001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLEAR</name>
                  <description>Clear output on counter overflow</description>
                  <value>0x00000002</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SET</name>
                  <description>Set output on counter overflow</description>
                  <value>0x00000003</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CUFOA</name>
              <description>Counter Underflow Output Action</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>No action on counter underflow</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TOGGLE</name>
                  <description>Toggle output on counter underflow</description>
                  <value>0x00000001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLEAR</name>
                  <description>Clear output on counter underflow</description>
                  <value>0x00000002</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SET</name>
                  <description>Set output on counter underflow</description>
                  <value>0x00000003</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PRSSEL</name>
              <description>Compare/Capture Channel PRS Input Channel Selection</description>
              <bitOffset>16</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PRSCH0</name>
                  <description>PRS Channel 0 selected as input</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRSCH1</name>
                  <description>PRS Channel 1 selected as input</description>
                  <value>0x00000001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRSCH2</name>
                  <description>PRS Channel 2 selected as input</description>
                  <value>0x00000002</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRSCH3</name>
                  <description>PRS Channel 3 selected as input</description>
                  <value>0x00000003</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRSCH4</name>
                  <description>PRS Channel 4 selected as input</description>
                  <value>0x00000004</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRSCH5</name>
                  <description>PRS Channel 5 selected as input</description>
                  <value>0x00000005</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRSCH6</name>
                  <description>PRS Channel 6 selected as input</description>
                  <value>0x00000006</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRSCH7</name>
                  <description>PRS Channel 7 selected as input</description>
                  <value>0x00000007</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ICEDGE</name>
              <description>Input Capture Edge Select</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RISING</name>
                  <description>Rising edges detected</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FALLING</name>
                  <description>Falling edges detected</description>
                  <value>0x00000001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BOTH</name>
                  <description>Both edges detected</description>
                  <value>0x00000002</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>No edge detection, signal is left as it is</description>
                  <value>0x00000003</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ICEVCTRL</name>
              <description>Input Capture Event Control</description>
              <bitOffset>26</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EVERYEDGE</name>
                  <description>PRS output pulse and interrupt flag set on every capture</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EVERYSECONDEDGE</name>
                  <description>PRS output pulse and interrupt flag set on every second capture</description>
                  <value>0x00000001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RISING</name>
                  <description>PRS output pulse and interrupt flag set on rising edge only (if ICEDGE = BOTH)</description>
                  <value>0x00000002</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FALLING</name>
                  <description>PRS output pulse and interrupt flag set on falling edge only (if ICEDGE = BOTH)</description>
                  <value>0x00000003</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PRSCONF</name>
              <description>PRS Configuration</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INSEL</name>
              <description>Input Selection</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FILT</name>
              <description>Digital Filter</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CC2_CCV</name>
          <description>CC Channel Value Register</description>
          <addressOffset>0x084</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <readAction>modifyExternal</readAction>
          <fields>
            <field>
              <name>CCV</name>
              <description>CC Channel Value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CC2_CCVP</name>
          <description>CC Channel Value Peek Register</description>
          <addressOffset>0x088</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CCVP</name>
              <description>CC Channel Value Peek</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CC2_CCVB</name>
          <description>CC Channel Buffer Register</description>
          <addressOffset>0x08C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CCVB</name>
              <description>CC Channel Value Buffer</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
